<?php

namespace App\Surveys;

class SurveyQuestionData
{

    /**
     * @var questions
     */
    public $questions =
    [
        [
            "id" => "scale-1",
            "name" => "Шкала 1",
            "questions" => [
                [
                    "id" => "question-1",
                    "title" => "1. Медлительные люди обычно действуют мне на нервы",
                ],
                [
                    "id" => "question-2",
                    "title" => "2. Меня раздражают суетливые, непоседливые люди",
                ],
                [
                    "id" => "question-3",
                    "title" => "3. Шумные детские игры я переношу с трудом",
                ],
                [
                    "id" => "question-4",
                    "title" => "4. Оригинальные, нестандартные, 
                        яркие личности чаще всего действуют на меня отрицательно",
                ],
                [
                    "id" => "question-5",
                    "title" => "5. Безупречный во всех отношениях человек насторожил бы меня",
                ],
            ]
        ],
        [
            "id" => "scale-2",
            "name" => "Шкала 2",
            "questions" => [
                [
                    "id" => "question-6",
                    "title" => "6. Меня обычно выводит из равновесия несообразительный собеседник",
                ],
                [
                    "id" => "question-7",
                    "title" => "7. Меня раздражают любители поговорить",
                ],
                [
                    "id" => "question-8",
                    "title" => "8. Меня затрудняет разговор с безразличным для меня попутчиком в поезде
                        (самолете), начатый по его инициативе",
                ],
                [
                    "id" => "question-9",
                    "title" => "9. Я бы тяготился разговорами случайного попутчика, который уступает
                        мне по уровню знаний и культуры",
                ],
                [
                    "id" => "question-10",
                    "title" => "10. Мне трудно найти общий язык с партнерами иного интеллектуального
                        уровня, чем у меня",
                ],
            ]
        ],
        [
            "id" => "scale-3",
            "name" => "Шкала 3",
            "questions" => [
                [
                    "id" => "question-11",
                    "title" => "11. Современная молодежь вызывает неприятные чувства
                        своим внешним видом (прически, косметика, наряды)",
                ],
                [
                    "id" => "question-12",
                    "title" => "12. Так называемые “новые русские” обычно
                        производят неприятное впечатление либо бескультурьем, либо рвачеством",
                ],
                [
                    "id" => "question-13",
                    "title" => "13. Представители некоторых национальностей в моем окружении
                        откровенно мне несимпатичны",
                ],
                [
                    "id" => "question-14",
                    "title" => "14. Есть тип мужчин (женщин), который я не выношу",
                ],
                [
                    "id" => "question-15",
                    "title" => "15. Терпеть не могу деловых партнеров с
                        низким интеллектуальным или профессиональным уровнем",
                ],
            ]
        ],
        [
            "id" => "scale-4",
            "name" => "Шкала 4",
            "questions" => [
                [
                    "id" => "question-16",
                    "title" => "16. Считаю, что на грубость надо отвечать тем же",
                ],
                [
                    "id" => "question-17",
                    "title" => "17. Мне трудно скрыть, если человек мне чем-либо неприятен",
                ],
                [
                    "id" => "question-18",
                    "title" => "18. Меня раздражают люди, стремящиеся в споре настоять на своем",
                ],
                [
                    "id" => "question-19",
                    "title" => "19. Мне неприятны самоуверенные люди",
                ],
                [
                    "id" => "question-20",
                    "title" => "20. Обычно мне трудно удержаться от замечания в адрес озлобленного или
                         нервного человека, который толкается в транспорте",
                ],
            ]
        ],
        [
            "id" => "scale-5",
            "name" => "Шкала 5",
            "questions" => [
                [
                    "id" => "question-21",
                    "title" => "21. Я имею привычку поучать окружающих",
                ],
                [
                    "id" => "question-22",
                    "title" => "22. Невоспитанные люди возмущают меня",
                ],
                [
                    "id" => "question-23",
                    "title" => "23. Я часто ловлю себя на том, что пытаюсь воспитывать кого-либо",
                ],
                [
                    "id" => "question-24",
                    "title" => "24. Я по привычке постоянно делаю кому-либо замечания",
                ],
                [
                    "id" => "question-25",
                    "title" => "25. Я люблю командовать близкими",
                ],
            ]
        ],
        [
            "id" => "scale-6",
            "name" => "Шкала 6",
            "questions" => [
                [
                    "id" => "question-26",
                    "title" => "26. Меня раздражают старики, когда они в час пик оказываются в городском
                        транспорте или в магазинах",
                ],
                [
                    "id" => "question-27",
                    "title" => "27. Жить в номере гостиницы с посторонним человеком 
                        для меня просто пытка",
                ],
                [
                    "id" => "question-28",
                    "title" => "28. Когда партнер не соглашается в чем-то с моей правильной позицией, то
                        обычно это раздражает меня",
                ],
                [
                    "id" => "question-29",
                    "title" => "29. Я проявляю нетерпение, когда мне возражают",
                ],
                [
                    "id" => "question-30",
                    "title" => "30. Меня раздражает, если партнер делает что-то по-своему,
                        не так, как мне того хочется",
                ],
            ]
        ],
        [
            "id" => "scale-7",
            "name" => "Шкала 7",
            "questions" => [
                [
                    "id" => "question-31",
                    "title" => "31. Современная молодежь вызывает неприятные чувства
                        своим внешним видом (прически, косметика, наряды)",
                ],
                [
                    "id" => "question-32",
                    "title" => "32. Так называемые “новые русские” обычно
                        производят неприятное впечатление либо бескультурьем, либо рвачеством",
                ],
                [
                    "id" => "question-33",
                    "title" => "33. Представители некоторых национальностей в моем окружении
                        откровенно мне несимпатичны",
                ],
                [
                    "id" => "question-34",
                    "title" => "34. Есть тип мужчин (женщин), который я не выношу",
                ],
                [
                    "id" => "question-35",
                    "title" => "35. Терпеть не могу деловых партнеров с
                        низким интеллектуальным или профессиональным уровнем",
                ],
            ]
        ],
        [
            "id" => "scale-8",
            "name" => "Шкала 8",
            "questions" => [
                [
                    "id" => "question-36",
                    "title" => "36. Я осуждаю людей, которые плачутся в чужую жилетку",
                ],
                [
                    "id" => "question-37",
                    "title" => "37. Внутренне я не одобряю своих знакомых,
                        которые при удобном случае рассказывают о своих болезнях",
                ],
                [
                    "id" => "question-38",
                    "title" => "38. Я стараюсь уходить от разговора, 
                        когда кто-нибудь начинает жаловаться на свою семейную жизнь",
                ],
                [
                    "id" => "question-39",
                    "title" => "39. Обычно я без особого внимания выслушиваю исповеди друзей (подруг)",
                ],
                [
                    "id" => "question-40",
                    "title" => "40. Мне иногда нравится позлить
                         кого-нибудь из родных или друзей",
                ],
            ]
        ],
        [
            "id" => "scale-9",
            "name" => "Шкала 9",
            "questions" => [
                [
                    "id" => "question-41",
                    "title" => "41. . Как правило, мне трудно идти на уступки партнерам",
                ],
                [
                    "id" => "question-42",
                    "title" => "42. Мне трудно ладить с людьми, у которых плохой характер",
                ],
                [
                    "id" => "question-43",
                    "title" => "43. Обычно я с трудом приспосабливаюсь к новым
                         партнерам по совместной работе",
                ],
                [
                    "id" => "question-44",
                    "title" => "44. Я стараюсь не поддерживать отношения с несколько странными людьми",
                ],
                [
                    "id" => "question-45",
                    "title" => "45. Чаще всего я из принципа настаиваю на своем,
                         даже если понимаю, что партнер прав",
                ],
            ]
        ],
    ];

    /**
     * @var questions2
     */
    public $questions2 =  [
        [
            "id" => "scale-1",
            "name" => "Шкала 1",
            "questions" => [
                [
                    "id" => "question-1",
                    "title" => "1. В смешанных браках обычно больше проблем,
                        чем в браках между людьми одной национальности",
                    "reversed" => true,
                ],
                [
                    "id" => "question-2",
                    "title" => "2. К кавказцам станут относиться лучше, если они изменят своё поведение",
                    "reversed" => true,
                ],
                [
                    "id" => "question-3",
                    "title" => "3. Нормально считать, что твой народ лучше, чем все остальные",
                    "reversed" => true,
                ],
                [
                    "id" => "question-4",
                    "title" => "4. Я готов принять в качестве члена своей семьи человека любой национальности",
                    "reversed" => false,
                ],
                [
                    "id" => "question-5",
                    "title" => "5. Я хочу, чтобы среди моих друзей были люди разных национальностей",
                    "reversed" => false,
                ],
                [
                    "id" => "question-6",
                    "title" => "6. К некоторым нациям и народам трудно хорошо относиться",
                    "reversed" => true,
                ],
                [
                    "id" => "question-7",
                    "title" => "7. Я могу представить чернокожего человека своим близким другом",
                    "reversed" => false,
                ],
            ]
        ], [
            "id" => "scale-2",
            "name" => "Шкала 2",
            "questions" => [
                [
                    "id" => "question-8",
                    "title" => "8. В средствах массовой информации может быть представлено любое мнение",
                    "reversed" => false,
                ],
                [
                    "id" => "question-9",
                    "title" => "9. Нищие и бродяги сами виноваты в своих проблемах",
                    "reversed" => true,
                ],
                [
                    "id" => "question-10",
                    "title" => "10. С неопрятными людьми неприятно общаться",
                    "reversed" => true,
                ],
                [
                    "id" => "question-11",
                    "title" => "11. Всех психически больных людей необходимо изолировать от общества",
                    "reversed" => true,
                ],
                [
                    "id" => "question-12",
                    "title" => "12. Беженцам надо помогать не больше, чем всем остальным,
                        так как у местных проблем не меньше",
                    "reversed" => true,
                ],
                [
                    "id" => "question-13",
                    "title" => "13. Для наведения порядка в стране необходима \"сильная рука\"",
                    "reversed" => true,
                ],
                [
                    "id" => "question-14",
                    "title" => "14. Приезжие должны иметь те же права, что и местные жители",
                    "reversed" => false,
                ],
                [
                    "id" => "question-15",
                    "title" => "15. Любые религиозные течения имеют право на существование",
                    "reversed" => false,
                ],
            ]
        ], [
            "id" => "scale-3",
            "name" => "Шкала 3",
            "questions" => [
                [
                    "id" => "question-16",
                    "title" => "16. Если друг предал, надо отомстить ему",
                    "reversed" => false,
                ],
                [
                    "id" => "question-17",
                    "title" => "17. В споре может быть правильной только одна точка зрения",
                    "reversed" => true,
                ],
                [
                    "id" => "question-18",
                    "title" => "18. Даже если у меня есть своё мнение, я готов выслушать и другие точки зрения",
                    "reversed" => true,
                ],
                [
                    "id" => "question-19",
                    "title" => "19. Если кто-то поступает со мной грубо, я отвечаю тем же",
                    "reversed" => true,
                ],
                [
                    "id" => "question-20",
                    "title" => "20. Человек, который думает не так как я, вызывает у меня раздражение",
                    "reversed" => true,
                ],
                [
                    "id" => "question-21",
                    "title" => "21. Беспорядок меня очень раздражает",
                    "reversed" => true,
                ],
                [
                    "id" => "question-22",
                    "title" => "22. Я хотел бы стать более терпимым человеком по отношению к другим",
                    "reversed" => false,
                ],
            ]
        ],
    ];

    /**
     * @var questions3
     */
    public $questions3 =  [
        [
            "id" => "scale-1",
            "name" => "Шкала Кинси",
            "questions" => [
                [
                    "id" => "question-1",
                    "title" => "Шкала Кинси",
                ]
            ]
        ]
    ];

    /**
     * @var selectOptions
     */
    public $selectOptions4 =  [
        "typeA" => [
            "1. Только противоположный пол", "2. В основном противоположный пол", "3. Больше противоположный пол",
            "4. Оба пола одинаково", "5. Больше свой пол", "6. В основном свой пол", "7. Только свой пол"
        ],
        "typeB" => [
            "1. Только гетеросексуальный", "2. В основном гетеросексуальный", "3. Больше гетеросексульный",
            "4. Гомо- и гетеросексуальный", "5. Больше гомосексуальный", "6. В основном гомосексуальный",
            "7. Только гомосексуальный"
        ]
    ];

    /**
     * @var questions4
     */
    public $questions4 =  [
        [
            "id" => "scale-1",
            "name" => "Шкала Кинси",
            "questions" => [
                [
                    "id" => "question-1",
                    "title" => "Сексуальное влечение",
                    "description" => "Какой пол вызывает наибольшее сексуальное желание?",
                    "options" => [
                        "1. Только противоположный пол", "2. В основном противоположный пол", "3. Больше противоположный пол",
                        "4. Оба пола одинаково", "5. Больше свой пол", "6. В основном свой пол", "7. Только свой пол"
                    ],
                ], [
                    "id" => "question-2",
                    "title" => "Сексуальное поведение",
                    "description" => "Информация о настоящих сексуальных партнерах",
                    "options" => [
                        "1. Только противоположный пол", "2. В основном противоположный пол", "3. Больше противоположный пол",
                        "4. Оба пола одинаково", "5. Больше свой пол", "6. В основном свой пол", "7. Только свой пол"
                    ],
                ], [
                    "id" => "question-3",
                    "title" => "Сексуальные фантазии",
                    "description" => "Люди какого пола преобладают в ваших мечтах?",
                    "options" => [
                        "1. Только противоположный пол", "2. В основном противоположный пол", "3. Больше противоположный пол",
                        "4. Оба пола одинаково", "5. Больше свой пол", "6. В основном свой пол", "7. Только свой пол"
                    ],
                ], [
                    "id" => "question-4",
                    "title" => "Эмоциональные предпочтения",
                    "description" => "В компании людей какого пола вы чувствуете себя наиболее комфортно?",
                    "options" => [
                        "1. Только противоположный пол", "2. В основном противоположный пол", "3. Больше противоположный пол",
                        "4. Оба пола одинаково", "5. Больше свой пол", "6. В основном свой пол", "7. Только свой пол"
                    ],
                ], [
                    "id" => "question-5",
                    "title" => "Социальные предпочтения",
                    "description" => "в компании людей какого пола вы чувствуете себя наиболее надежно?",
                    "options" => [
                        "1. Только противоположный пол", "2. В основном противоположный пол", "3. Больше противоположный пол",
                        "4. Оба пола одинаково", "5. Больше свой пол", "6. В основном свой пол", "7. Только свой пол"
                    ],
                ], [
                    "id" => "question-6",
                    "title" => "Образ жизни",
                    "description" => "Люди какого пола преобладают в вашей компании в реальной жизни?",
                    "options" =>  [
                        "1. Только гетеросексуальный", "2. В основном гетеросексуальный", "3. Больше гетеросексульный",
                        "4. Гомо- и гетеросексуальный", "5. Больше гомосексуальный", "6. В основном гомосексуальный",
                        "7. Только гомосексуальный"
                    ]
                ], [
                    "id" => "question-7",
                    "title" => "Самоопределение",
                    "description" => "К какой сексуальной ориентации вы сами себя относите?",
                    "options" =>  [
                        "1. Только гетеросексуальный", "2. В основном гетеросексуальный", "3. Больше гетеросексульный",
                        "4. Гомо- и гетеросексуальный", "5. Больше гомосексуальный", "6. В основном гомосексуальный",
                        "7. Только гомосексуальный"
                    ]
                ],
            ]
        ]
    ];

    public $questions5 =  [
        [
            "id" => "scale-1",
            "name" => "Шкала 1",
            "questions" => [
                [
                    "id" => "question-1",
                    "title" => "1.",
                ],
                [
                    "id" => "question-2",
                    "title" => "2.",
                ],
                [
                    "id" => "question-3",
                    "title" => "3.",
                ],
                [
                    "id" => "question-4",
                    "title" => "4.",
                ],
                [
                    "id" => "question-5",
                    "title" => "5.",
                ],
                [
                    "id" => "question-6",
                    "title" => "6.",
                ],
                [
                    "id" => "question-7",
                    "title" => "7.",
                ],
                [
                    "id" => "question-8",
                    "title" => "8.",
                ],
                [
                    "id" => "question-9",
                    "title" => "9.",
                ],
                [
                    "id" => "question-10",
                    "title" => "10.",
                ],
                [
                    "id" => "question-11",
                    "title" => "11.",
                ],
                [
                    "id" => "question-12",
                    "title" => "12.",
                ],
                [
                    "id" => "question-13",
                    "title" => "13.",
                ],
                [
                    "id" => "question-14",
                    "title" => "14.",
                ],
                [
                    "id" => "question-15",
                    "title" => "15.",
                ],
                [
                    "id" => "question-16",
                    "title" => "16.",
                ],
                [
                    "id" => "question-17",
                    "title" => "17.",
                ],
                [
                    "id" => "question-18",
                    "title" => "18.",
                ],
                [
                    "id" => "question-19",
                    "title" => "19.",
                ],
                [
                    "id" => "question-20",
                    "title" => "20.",
                ],
            ]
        ]
    ];

    /**
     * Get all questions.
     */
    public function getQuestions()
    {
        
        $result = [];
        $result["Methodic 1"] = $this->questions;
        $result["Methodic 2"] = $this->questions2;
        $result["Methodic 3"] = $this->questions3;
        $result["Methodic 4"] = $this->questions4;
        $result["Methodic 5"] = $this->questions5;
        
        return $result;
    }
}
