<?php

namespace App\Surveys;

class SurveyQuestionData
{

    /**
     * @var questions
     */
    public $questions =
    [
        [
            "id" => "scale-1",
            "name" => "Шкала 1",
            "questions" => [
                [
                    "id" => "question-1",
                    "title" => "1. Медлительные люди обычно действуют мне на нервы",
                ],
                [
                    "id" => "question-2",
                    "title" => "2. Меня раздражают суетливые, непоседливые люди",
                ],
                [
                    "id" => "question-3",
                    "title" => "3. Шумные детские игры я переношу с трудом",
                ],
                [
                    "id" => "question-4",
                    "title" => "4. Оригинальные, нестандартные, 
                        яркие личности чаще всего действуют на меня отрицательно",
                ],
                [
                    "id" => "question-5",
                    "title" => "5. Безупречный во всех отношениях человек насторожил бы меня",
                ],
            ]
        ],
        [
            "id" => "scale-2",
            "name" => "Шкала 2",
            "questions" => [
                [
                    "id" => "question-6",
                    "title" => "6. Медлительные люди обычно действуют мне на нервы",
                ],
                [
                    "id" => "question-7",
                    "title" => "7. Меня раздражают суетливые, непоседливые люди",
                ],
                [
                    "id" => "question-8",
                    "title" => "8. Шумные детские игры я переношу с трудом",
                ],
                [
                    "id" => "question-9",
                    "title" => "9. Оригинальные, нестандартные,
                        яркие личности чаще всего действуют на меня отрицательно",
                ],
                [
                    "id" => "question-10",
                    "title" => "10. Безупречный во всех отношениях человек насторожил бы меня",
                ],
            ]
        ],
        [
            "id" => "scale-3",
            "name" => "Шкала 3",
            "questions" => [
                [
                    "id" => "question-11",
                    "title" => "11. Современная молодежь вызывает неприятные чувства
                        своим внешним видом (прически, косметика, наряды)",
                ],
                [
                    "id" => "question-12",
                    "title" => "12. Так называемые “новые русские” обычно
                        производят неприятное впечатление либо бескультурьем, либо рвачеством",
                ],
                [
                    "id" => "question-13",
                    "title" => "13. Представители некоторых национальностей в моем окружении
                        откровенно мне несимпатичны",
                ],
                [
                    "id" => "question-14",
                    "title" => "14. Есть тип мужчин (женщин), который я не выношу",
                ],
                [
                    "id" => "question-15",
                    "title" => "15. Терпеть не могу деловых партнеров с
                        низким интеллектуальным или профессиональным уровнем",
                ],
            ]
        ],
        [
            "id" => "scale-4",
            "name" => "Шкала 4",
            "questions" => [
                [
                    "id" => "question-16",
                    "title" => "16. Считаю, что на грубость надо отвечать тем же",
                ],
                [
                    "id" => "question-17",
                    "title" => "17. Мне трудно скрыть, если человек мне чем-либо неприятен",
                ],
                [
                    "id" => "question-18",
                    "title" => "18. Меня раздражают люди, стремящиеся в споре настоять на своем",
                ],
                [
                    "id" => "question-19",
                    "title" => "19. Мне неприятны самоуверенные люди",
                ],
                [
                    "id" => "question-20",
                    "title" => "20. Обычно мне трудно удержаться от замечания в адрес озлобленного или
                         нервного человека, который толкается в транспорте",
                ],
            ]
        ],
        [
            "id" => "scale-5",
            "name" => "Шкала 5",
            "questions" => [
                [
                    "id" => "question-21",
                    "title" => "21. Я имею привычку поучать окружающих",
                ],
                [
                    "id" => "question-22",
                    "title" => "22. Невоспитанные люди возмущают меня",
                ],
                [
                    "id" => "question-23",
                    "title" => "23. Я часто ловлю себя на том, что пытаюсь воспитывать кого-либо",
                ],
                [
                    "id" => "question-24",
                    "title" => "24. Я по привычке постоянно делаю кому-либо замечания",
                ],
                [
                    "id" => "question-25",
                    "title" => "25. Я люблю командовать близкими",
                ],
            ]
        ],
        [
            "id" => "scale-6",
            "name" => "Шкала 6",
            "questions" => [
                [
                    "id" => "question-26",
                    "title" => "26. Меня раздражают старики, когда они в час пик оказываются в городском
                        транспорте или в магазинах",
                ],
                [
                    "id" => "question-27",
                    "title" => "27. Жить в номере гостиницы с посторонним человеком 
                        для меня просто пытка",
                ],
                [
                    "id" => "question-28",
                    "title" => "28. Когда партнер не соглашается в чем-то с моей правильной позицией, то
                        обычно это раздражает меня",
                ],
                [
                    "id" => "question-29",
                    "title" => "29. Я проявляю нетерпение, когда мне возражают",
                ],
                [
                    "id" => "question-30",
                    "title" => "30. Меня раздражает, если партнер делает что-то по-своему,
                        не так, как мне того хочется",
                ],
            ]
        ],
        [
            "id" => "scale-7",
            "name" => "Шкала 7",
            "questions" => [
                [
                    "id" => "question-31",
                    "title" => "31. Современная молодежь вызывает неприятные чувства
                        своим внешним видом (прически, косметика, наряды)",
                ],
                [
                    "id" => "question-32",
                    "title" => "32. Так называемые “новые русские” обычно
                        производят неприятное впечатление либо бескультурьем, либо рвачеством",
                ],
                [
                    "id" => "question-33",
                    "title" => "33. Представители некоторых национальностей в моем окружении
                        откровенно мне несимпатичны",
                ],
                [
                    "id" => "question-34",
                    "title" => "34. Есть тип мужчин (женщин), который я не выношу",
                ],
                [
                    "id" => "question-35",
                    "title" => "35. Терпеть не могу деловых партнеров с
                        низким интеллектуальным или профессиональным уровнем",
                ],
            ]
        ],
        [
            "id" => "scale-8",
            "name" => "Шкала 8",
            "questions" => [
                [
                    "id" => "question-36",
                    "title" => "36. Я осуждаю людей, которые плачутся в чужую жилетку",
                ],
                [
                    "id" => "question-37",
                    "title" => "37. Внутренне я не одобряю своих знакомых,
                        которые при удобном случае рассказывают о своих болезнях",
                ],
                [
                    "id" => "question-38",
                    "title" => "38. Я стараюсь уходить от разговора, 
                        когда кто-нибудь начинает жаловаться на свою семейную жизнь",
                ],
                [
                    "id" => "question-39",
                    "title" => "39. Обычно я без особого внимания выслушиваю исповеди друзей (подруг)",
                ],
                [
                    "id" => "question-40",
                    "title" => "40. Мне иногда нравится позлить
                         кого-нибудь из родных или друзей",
                ],
            ]
        ],
        [
            "id" => "scale-9",
            "name" => "Шкала 9",
            "questions" => [
                [
                    "id" => "question-41",
                    "title" => "41. . Как правило, мне трудно идти на уступки партнерам",
                ],
                [
                    "id" => "question-42",
                    "title" => "42. Мне трудно ладить с людьми, у которых плохой характер",
                ],
                [
                    "id" => "question-43",
                    "title" => "43. Обычно я с трудом приспосабливаюсь к новым
                         партнерам по совместной работе",
                ],
                [
                    "id" => "question-44",
                    "title" => "44. Я стараюсь не поддерживать отношения с несколько странными людьми",
                ],
                [
                    "id" => "question-45",
                    "title" => "45. Чаще всего я из принципа настаиваю на своем,
                         даже если понимаю, что партнер прав",
                ],
            ]
        ],
    ];

    /**
     * Get all questions.
     */
    public function getQuestions()
    {
        return $this->questions;
    }
}
